## 정렬sort)

- 데이터 정렬
- 기준
    - 인덱스 => sort_index()
    - 값 => sort_value()

In [2]:
# 모듈 로딩 -------------------------------------------------
import pandas as pd
import numpy as np                  # nan 사용

# 데이터 생성 ------------------------------------------------
df=pd.DataFrame({'value':[4, 1, 2, 3, 5],
                 'name': ['John Kim', 'GilDong Hong', 'Tom', 'Lee', 'Annan Jung'],
                 'age': [12, np.nan, 10, 6, np.nan]})

# 데이터 정보 확인 -------------------------------------------
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   name    5 non-null      object
 2   age     3 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 248.0+ bytes

In [4]:
# 인덱스 & 컬럼 확인
print(df.index, df.columns, sep='\n')

RangeIndex(start=0, stop=5, step=1)
Index(['value', 'name', 'age'], dtype='object')

In [7]:
# 정렬하기 -------------------------------------------
# [기본] 오름차순
df.sort_index(ascending=False)

   value          name   age
4      5    Annan Jung   NaN
3      3           Lee   6.0
2      2           Tom  10.0
1      1  GilDong Hong   NaN
0      4      John Kim  12.0

In [8]:
# 특정 컬럼 기준 정렬 => sort_values()
# name 컬럼으로 정렬
df.sort_values(by='name', ascending=False)

   value          name   age
2      2           Tom  10.0
3      3           Lee   6.0
0      4      John Kim  12.0
1      1  GilDong Hong   NaN
4      5    Annan Jung   NaN

In [9]:
df.name[0], len(df.name[0])

('John Kim', 8)

In [22]:
nameLength=[len(name) for name in df['name']]

In [24]:
df['nameLength'] = nameLength

In [26]:
df.sort_values('nameLength', ascending=False)

   value          name   age  nameLength
1      1  GilDong Hong   NaN          12
4      5    Annan Jung   NaN          10
0      4      John Kim  12.0           8
2      2           Tom  10.0           3
3      3           Lee   6.0           3

In [27]:
# name len 으로 정렬 방법
df.sort_values(by='name', )

   value          name   age  nameLength
4      5    Annan Jung   NaN          10
1      1  GilDong Hong   NaN          12
0      4      John Kim  12.0           8
3      3           Lee   6.0           3
2      2           Tom  10.0           3

In [28]:
#df.sort_values(by='len', ascending=False)

In [29]:
#df['name']

# 컬럼명 정렬 ------------------------------------

In [30]:
df.columns, type(df.columns), list(df.columns)

(Index(['value', 'name', 'age', 'nameLength'], dtype='object'),
 pandas.core.indexes.base.Index,
 ['value', 'name', 'age', 'nameLength'])

In [32]:
colList=list(df.columns)

In [33]:
colList.sort()
colList

['age', 'name', 'nameLength', 'value']

In [34]:
df2=df[colList]
df2

    age          name  nameLength  value
0  12.0      John Kim           8      4
1   NaN  GilDong Hong          12      1
2  10.0           Tom           3      2
3   6.0           Lee           3      3
4   NaN    Annan Jung          10      5

In [37]:
#df2=df[['age', 'name', 'nameLength', 'value']]
#df2

In [38]:
df3=df.T
df3

                   0             1     2    3           4
value              4             1     2    3           5
name        John Kim  GilDong Hong   Tom  Lee  Annan Jung
age             12.0           NaN  10.0  6.0         NaN
nameLength         8            12     3    3          10